zhengwang721/ASF/thirdparty/wireless/avr2025_mac/examples/mac/no_beacon_sleep/main.c
#define INTER_FRAME_DURATION_US         (200000)

/* === GLOBALS ============================================================= */

/** This structure stores the short and extended address of the coordinator. */
static associated_device_t coord_addr;
/** Number of done network scans */
static uint8_t number_of_scans;
/** This array stores all device related information. */
static associated_device_t device_list[MAX_NUMBER_OF_DEVICES];
/** Current status of the node. */
static node_status_t node_status;

volatile bool timer_flag = false;
volatile bool in_sleep_mode = false;

static uint8_t TIMER_LED_OFF;
static uint8_t WAKE_TIMER;

enum sleepmgr_mode mode = SLEEPMGR_IDLE;

/* === PROTOTYPES ========================================================== */

static void app_task(void);
static void network_scan_indication_cb(void *parameter);
static void data_exchange_led_off_cb(void *parameter);
static void awake_timer_cb(void *parameter);
static bool assign_new_short_addr(uint64_t addr64, uint16_t *addr16);
static void app_alert(void);

/* === IMPLEMENTATION ====================================================== */
/*! \brief Main function.
 */
int main(void)
{
	/* Initialize the board.
	 * The board-specific conf_board.h file contains the configuration of
	 * the board initialization.
	 */
	irq_initialize_vectors();
	board_init();
	sysclk_init();

	sw_timer_init();

	if(MAC_SUCCESS != wpan_init())
	{
        /*
         * Stay here; we need a valid IEEE address.
         * Check kit documentation how to create an IEEE address
         * and to store it into the EEPROM.
         */
		app_alert();
	}

    /* Initialize LEDs. */
    LED_On(LED_START);         // indicating application is started
    LED_Off(LED_NWK_SETUP);    // indicating node is associated
    LED_Off(LED_DATA);         // indicating successfull data transmission

	cpu_irq_enable();

	sw_timer_get_id(&TIMER_LED_OFF);
	sw_timer_get_id(&WAKE_TIMER);

	node_status = COLD_START_RESET;

    /*
     * Reset the MAC layer to the default values
     * This request will cause a mlme reset confirm message ->
     * usr_mlme_reset_conf
     */
    wpan_mlme_reset_req(true);

    /* Main loop */
	while (true)
	{
		wpan_task();
        app_task(); /* Application task */
	}
}


#if defined(ENABLE_TSTAMP)
void usr_mcps_data_conf(uint8_t msduHandle,
                        uint8_t status,
                        uint32_t Timestamp)
#else
void usr_mcps_data_conf(uint8_t msduHandle,
                        uint8_t status)
#endif  /* ENABLE_TSTAMP */
{
    node_status = IDLE;

    if (status == MAC_SUCCESS)
    {
        /*
         * Dummy data has been transmitted successfully.
         * Application code could be added here ...
         */
        LED_On(LED_DATA);
        // Start a timer switching off the LED
        sw_timer_start(TIMER_LED_OFF,
                        500000,
                        SW_TIMEOUT_RELATIVE,
                        (FUNC_PTR)data_exchange_led_off_cb,
                        NULL);
    }

    /* Keep compiler happy. */
    msduHandle = msduHandle;
}


void usr_mcps_data_ind(wpan_addr_spec_t *SrcAddrSpec,
                       wpan_addr_spec_t *DstAddrSpec,
                       uint8_t msduLength,
                       uint8_t *msdu,
                       uint8_t mpduLinkQuality,
#ifdef ENABLE_TSTAMP
                       uint8_t DSN,
                       uint32_t Timestamp)
#else
                       uint8_t DSN)
#endif  /* ENABLE_TSTAMP */
{
    /*
     * Dummy data has been received successfully.
     * Application code could be added here ...
     */
    LED_On(LED_DATA);
    // Start a timer switching off the LED
    sw_timer_start(TIMER_LED_OFF,
                    500000,
                    SW_TIMEOUT_RELATIVE,
                    (FUNC_PTR)data_exchange_led_off_cb,
                    NULL);

    /* Keep compiler happy. */
    SrcAddrSpec = SrcAddrSpec;
    DstAddrSpec = DstAddrSpec;
    msduLength = msduLength;
    msdu = msdu;
    mpduLinkQuality = mpduLinkQuality;
    DSN = DSN;
}


#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
void usr_mcps_purge_conf(uint8_t msduHandle,
                         uint8_t status)
{
	
}
#endif  /* ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1)) */


#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1)
void usr_mlme_associate_conf(uint16_t AssocShortAddress,
                             uint8_t status)
{
    if (status == MAC_SUCCESS)
    {
        // Stop timer used for search indication (same as used for data transmission)
        sw_timer_stop(TIMER_LED_OFF);
        LED_On(LED_NWK_SETUP);

        node_status = IDLE;
		sw_timer_start(TIMER_LED_OFF,
					   DATA_TX_PERIOD,
					   SW_TIMEOUT_RELATIVE,
					   (FUNC_PTR)awake_timer_cb,
					   NULL);
    }
    else
    {
        // Something went wrong; restart
        wpan_mlme_reset_req(true);
    }

    /* Keep compiler happy. */
    AssocShortAddress = AssocShortAddress;
}
#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */


#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)
void usr_mlme_associate_ind(uint64_t DeviceAddress,
                            uint8_t CapabilityInformation)
{
    /*
     * Any device is allowed to join the network
     * Use: bool wpan_mlme_associate_resp(uint64_t DeviceAddress,
     *                                    uint16_t AssocShortAddress,
     *                                    uint8_t status);
     *
     * This response leads to comm status indication -> usr_mlme_comm_status_ind
     * Get the next available short address for this device
     */
    uint16_t associate_short_addr = macShortAddress_def;

    if (assign_new_short_addr(DeviceAddress, &associate_short_addr) == true)
    {
        wpan_mlme_associate_resp(DeviceAddress,
                                 associate_short_addr,
                                 ASSOCIATION_SUCCESSFUL);
    }
    else
    {
        wpan_mlme_associate_resp(DeviceAddress,
                                 associate_short_addr,
                                 PAN_AT_CAPACITY);
    }

    /* Keep compiler happy. */
    CapabilityInformation = CapabilityInformation;
}
#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */


#if (MAC_BEACON_NOTIFY_INDICATION == 1)
void usr_mlme_beacon_notify_ind(uint8_t BSN,
                                wpan_pandescriptor_t *PANDescriptor,
                                uint8_t PendAddrSpec,
                                uint8_t *AddrList,
                                uint8_t sduLength,
                                uint8_t *sdu)
{
	
